#include "reg.h"
#include "ui_reg.h"
#include <QTcpSocket>

Reg::Reg(QWidget *parent) :
    QMainWindow(parent),
    ui(new Ui::Reg)
{
    ui->setupUi(this);
}

Reg::~Reg()
{
    delete ui;
}

void Reg::on_pushButton_clicked()
{
    emit show_log();
    close();
}

void Reg::on_pushButton_2_clicked()
{
    // конект сервера
    // перевірка коректності вводу логіна (без всякої херні аля \ * ( ) ; ; і тд)  булеві змінні? щоби ними забороняти
    // перевірка на відповідність прешого паролю другому                            кнопку реєстрації
    // (підкреслення або показ міток, що типу все погано, або міняти текст міток)
    //  перевірка наявності такого користувача, вивідо помилки або посил на Бд щоби записала
    // там (на бд) встановлення дефолтних конфігурацій, вони там будуть вписані, ці конф читаються разом з ІД
    // вивід повідомлення про вдалу реєсрацію .месбокс кароч, і привітання?
    emit show_main();
    close();
}
